[Survived] ConditionalExpression
typescript/quotes-api/src/app.ts:24:9
 
   const app: express.Application = express();
   try {
-    if (process.env.PRODUCTION_DATABASE) {
+    if (true) {
       const closeConnection = await mongoose.connect(process.env.PRODUCTION_DATABASE);
       App.closeConnection = closeConnection;

[Survived] StringLiteral
typescript/quotes-api/src/app.ts:27:19
     if (process.env.PRODUCTION_DATABASE) {
       const closeConnection = await mongoose.connect(process.env.PRODUCTION_DATABASE);
       App.closeConnection = closeConnection;
-      console.log('Database connected successfully');
+      console.log("");
     } else {
       throw new Error('provided a connection url in the environment');

[NoCoverage] BlockStatement
typescript/quotes-api/src/app.ts:28:12
       const closeConnection = await mongoose.connect(process.env.PRODUCTION_DATABASE);
       App.closeConnection = closeConnection;
       console.log('Database connected successfully');
-    } else {
-      throw new Error('provided a connection url in the environment');
-    }
+    } else {}
   } catch (err: any) {
     console.log(err.message);

[NoCoverage] BlockStatement
typescript/quotes-api/src/app.ts:31:22
     } else {
       throw new Error('provided a connection url in the environment');
     }
-  } catch (err: any) {
-    console.log(err.message);
-    process.exit(1);
-  }
+  } catch (err: any) {}
 
   app.use(cookieParser(process.env.COOKIE_SECRET));

[Survived] BooleanLiteral
typescript/quotes-api/src/app.ts:41:34
 
   app.use(helmet());
   app.use(logger('dev'));
-  app.use(bodyParser({ extended: false }));
+  app.use(bodyParser({ extended: true }));
 
   app.use('/api', userRouter);

[Survived] StringLiteral
typescript/quotes-api/src/app.ts:44:11
   app.use(bodyParser({ extended: false }));
 
   app.use('/api', userRouter);
-  app.use('/api', authenticationMiddleware);
+  app.use("", authenticationMiddleware);
   app.use('/api', quotesRouter);
 

[Survived] StringLiteral
typescript/quotes-api/src/app.ts:45:11
 
   app.use('/api', userRouter);
   app.use('/api', authenticationMiddleware);
-  app.use('/api', quotesRouter);
+  app.use("", quotesRouter);
 
   // error handler
