[NoCoverage] BlockStatement
quotes-api/src/middleware/index.ts:18:91
  * res.send(req.authUser)
  * })
  */
-export const authenticationMiddleware = (req:Request, res:Response, next:NextFunction) => {
-  try {
-    if (!req.session.token) return res.status(400).json({ error: 'no authorization' });
-    const { token } = req.session;
-    if (!process.env.JWT_SECRET) {
-      process.exit(1);
-    }
-    const tokenSecret: string = process.env.JWT_SECRET!;
-    jwt.verify(token, tokenSecret, (err, decoded) => {
-      if (err) return next(err);
-      req.authUser = decoded!;
-      next();
-    });
-  } catch (err) {
-    next(err);
-  }
-};
+export const authenticationMiddleware = (req:Request, res:Response, next:NextFunction) => {};
 
 /**

[NoCoverage] BlockStatement
quotes-api/src/middleware/index.ts:19:7
  * })
  */
 export const authenticationMiddleware = (req:Request, res:Response, next:NextFunction) => {
-  try {
-    if (!req.session.token) return res.status(400).json({ error: 'no authorization' });
-    const { token } = req.session;
-    if (!process.env.JWT_SECRET) {
-      process.exit(1);
-    }
-    const tokenSecret: string = process.env.JWT_SECRET!;
-    jwt.verify(token, tokenSecret, (err, decoded) => {
-      if (err) return next(err);
-      req.authUser = decoded!;
-      next();
-    });
-  } catch (err) {
+  try {} catch (err) {
     next(err);
   }

[NoCoverage] ConditionalExpression
quotes-api/src/middleware/index.ts:20:9
  */
 export const authenticationMiddleware = (req:Request, res:Response, next:NextFunction) => {
   try {
-    if (!req.session.token) return res.status(400).json({ error: 'no authorization' });
+    if (true) return res.status(400).json({ error: 'no authorization' });
     const { token } = req.session;
     if (!process.env.JWT_SECRET) {

[NoCoverage] BooleanLiteral
quotes-api/src/middleware/index.ts:20:9
  */
 export const authenticationMiddleware = (req:Request, res:Response, next:NextFunction) => {
   try {
-    if (!req.session.token) return res.status(400).json({ error: 'no authorization' });
+    if (req.session.token) return res.status(400).json({ error: 'no authorization' });
     const { token } = req.session;
     if (!process.env.JWT_SECRET) {

[NoCoverage] BlockStatement
quotes-api/src/middleware/index.ts:22:34
   try {
     if (!req.session.token) return res.status(400).json({ error: 'no authorization' });
     const { token } = req.session;
-    if (!process.env.JWT_SECRET) {
-      process.exit(1);
-    }
+    if (!process.env.JWT_SECRET) {}
     const tokenSecret: string = process.env.JWT_SECRET!;
     jwt.verify(token, tokenSecret, (err, decoded) => {

[NoCoverage] ConditionalExpression
quotes-api/src/middleware/index.ts:22:9
   try {
     if (!req.session.token) return res.status(400).json({ error: 'no authorization' });
     const { token } = req.session;
-    if (!process.env.JWT_SECRET) {
+    if (false) {
       process.exit(1);
     }

[NoCoverage] BlockStatement
quotes-api/src/middleware/index.ts:26:54
       process.exit(1);
     }
     const tokenSecret: string = process.env.JWT_SECRET!;
-    jwt.verify(token, tokenSecret, (err, decoded) => {
-      if (err) return next(err);
-      req.authUser = decoded!;
-      next();
-    });
+    jwt.verify(token, tokenSecret, (err, decoded) => {});
   } catch (err) {
     next(err);

[NoCoverage] ConditionalExpression
quotes-api/src/middleware/index.ts:27:11
     }
     const tokenSecret: string = process.env.JWT_SECRET!;
     jwt.verify(token, tokenSecret, (err, decoded) => {
-      if (err) return next(err);
+      if (false) return next(err);
       req.authUser = decoded!;
       next();

[NoCoverage] ConditionalExpression
quotes-api/src/middleware/index.ts:27:11
     }
     const tokenSecret: string = process.env.JWT_SECRET!;
     jwt.verify(token, tokenSecret, (err, decoded) => {
-      if (err) return next(err);
+      if (true) return next(err);
       req.authUser = decoded!;
       next();

[NoCoverage] BlockStatement
quotes-api/src/middleware/index.ts:44:6
   req: Request,
   res: Response,
   next: NextFunction,
-) => {
-  if (res.locals.error) {
-    return res.status(500).json({ error: err.message });
-  }
-  next(err);
-};
+) => {};
 
 /**

[NoCoverage] ConditionalExpression
quotes-api/src/middleware/index.ts:45:7
   res: Response,
   next: NextFunction,
 ) => {
-  if (res.locals.error) {
+  if (true) {
     return res.status(500).json({ error: err.message });
   }

[NoCoverage] BlockStatement
quotes-api/src/middleware/index.ts:45:25
   res: Response,
   next: NextFunction,
 ) => {
-  if (res.locals.error) {
-    return res.status(500).json({ error: err.message });
-  }
+  if (res.locals.error) {}
   next(err);
 };

[NoCoverage] BlockStatement
quotes-api/src/middleware/index.ts:54:59
 /**
  * 404 handler middleware
  */
-export const handle404 = (req: Request, res: Response) => {
-  res.status(404).json({ error: '404 - Are you lost!' });
-};
+export const handle404 = (req: Request, res: Response) => {};
 
