[NoCoverage] BlockStatement
quotes-api/src/controllers/quotes.ts:5:87
 import { Quote } from '../model/quote';
 import { QuotesRoutesError } from '../helpers/errors';
 
-export const getAllQuote = async (req: Request, res: Response, next: NextFunction) => {
-  try {
-    const notes = await Quote.find({});
-    return res.status(200).json(notes);
-  } catch (err: any) {
-    res.locals.error = new QuotesRoutesError(err.message);
-    next(err);
-  }
-};
+export const getAllQuote = async (req: Request, res: Response, next: NextFunction) => {};
 
 export const getSingleQuote = async (req: Request, res: Response, next: NextFunction) => {

[NoCoverage] BlockStatement
quotes-api/src/controllers/quotes.ts:6:7
 import { QuotesRoutesError } from '../helpers/errors';
 
 export const getAllQuote = async (req: Request, res: Response, next: NextFunction) => {
-  try {
-    const notes = await Quote.find({});
-    return res.status(200).json(notes);
-  } catch (err: any) {
+  try {} catch (err: any) {
     res.locals.error = new QuotesRoutesError(err.message);
     next(err);

[NoCoverage] BlockStatement
quotes-api/src/controllers/quotes.ts:9:22
   try {
     const notes = await Quote.find({});
     return res.status(200).json(notes);
-  } catch (err: any) {
-    res.locals.error = new QuotesRoutesError(err.message);
-    next(err);
-  }
+  } catch (err: any) {}
 };
 

[NoCoverage] BlockStatement
quotes-api/src/controllers/quotes.ts:15:90
   }
 };
 
-export const getSingleQuote = async (req: Request, res: Response, next: NextFunction) => {
-  try {
-    const quote = await Quote.findById(req.params.id);
-    res.status(200).json(quote);
-  } catch (err: any) {
-    res.locals.error = new QuotesRoutesError(err.message);
-    next(err);
-  }
-};
+export const getSingleQuote = async (req: Request, res: Response, next: NextFunction) => {};
 
 export const postQuote = async (req: Request, res: Response, next: NextFunction) => {

[NoCoverage] BlockStatement
quotes-api/src/controllers/quotes.ts:16:7
 };
 
 export const getSingleQuote = async (req: Request, res: Response, next: NextFunction) => {
-  try {
-    const quote = await Quote.findById(req.params.id);
-    res.status(200).json(quote);
-  } catch (err: any) {
+  try {} catch (err: any) {
     res.locals.error = new QuotesRoutesError(err.message);
     next(err);

[NoCoverage] BlockStatement
quotes-api/src/controllers/quotes.ts:19:22
   try {
     const quote = await Quote.findById(req.params.id);
     res.status(200).json(quote);
-  } catch (err: any) {
-    res.locals.error = new QuotesRoutesError(err.message);
-    next(err);
-  }
+  } catch (err: any) {}
 };
 

[NoCoverage] BlockStatement
quotes-api/src/controllers/quotes.ts:25:85
   }
 };
 
-export const postQuote = async (req: Request, res: Response, next: NextFunction) => {
-  const { quote } = req.body;
-  const { username } = req.authUser;
-  try {
-    if (!quote) {
-      return res.status(400).json({ error: 'where is the quote bro' });
-    }
-    const newQuote = new Quote({ user: username, quote });
-    await newQuote.save();
-    // eslint-disable-next-line no-underscore-dangle
-    res.status(200).json({ message: 'uploaded successfully', quote: newQuote });
-  } catch (err: any) {
-    res.locals.error = new QuotesRoutesError(err.message);
-    next(err);
-  }
-};
+export const postQuote = async (req: Request, res: Response, next: NextFunction) => {};
 
 export const getQuotesFromUser = async (req: Request, res: Response, next: NextFunction) => {

[NoCoverage] BlockStatement
quotes-api/src/controllers/quotes.ts:28:7
 export const postQuote = async (req: Request, res: Response, next: NextFunction) => {
   const { quote } = req.body;
   const { username } = req.authUser;
-  try {
-    if (!quote) {
-      return res.status(400).json({ error: 'where is the quote bro' });
-    }
-    const newQuote = new Quote({ user: username, quote });
-    await newQuote.save();
-    // eslint-disable-next-line no-underscore-dangle
-    res.status(200).json({ message: 'uploaded successfully', quote: newQuote });
-  } catch (err: any) {
+  try {} catch (err: any) {
     res.locals.error = new QuotesRoutesError(err.message);
     next(err);

[NoCoverage] BlockStatement
quotes-api/src/controllers/quotes.ts:29:17
   const { quote } = req.body;
   const { username } = req.authUser;
   try {
-    if (!quote) {
-      return res.status(400).json({ error: 'where is the quote bro' });
-    }
+    if (!quote) {}
     const newQuote = new Quote({ user: username, quote });
     await newQuote.save();

[NoCoverage] BooleanLiteral
quotes-api/src/controllers/quotes.ts:29:9
   const { quote } = req.body;
   const { username } = req.authUser;
   try {
-    if (!quote) {
+    if (quote) {
       return res.status(400).json({ error: 'where is the quote bro' });
     }

[NoCoverage] ObjectLiteral
quotes-api/src/controllers/quotes.ts:30:35
   const { username } = req.authUser;
   try {
     if (!quote) {
-      return res.status(400).json({ error: 'where is the quote bro' });
+      return res.status(400).json({});
     }
     const newQuote = new Quote({ user: username, quote });

[NoCoverage] ObjectLiteral
quotes-api/src/controllers/quotes.ts:35:26
     const newQuote = new Quote({ user: username, quote });
     await newQuote.save();
     // eslint-disable-next-line no-underscore-dangle
-    res.status(200).json({ message: 'uploaded successfully', quote: newQuote });
+    res.status(200).json({});
   } catch (err: any) {
     res.locals.error = new QuotesRoutesError(err.message);

[NoCoverage] BlockStatement
quotes-api/src/controllers/quotes.ts:36:22
     await newQuote.save();
     // eslint-disable-next-line no-underscore-dangle
     res.status(200).json({ message: 'uploaded successfully', quote: newQuote });
-  } catch (err: any) {
-    res.locals.error = new QuotesRoutesError(err.message);
-    next(err);
-  }
+  } catch (err: any) {}
 };
 

[NoCoverage] BlockStatement
quotes-api/src/controllers/quotes.ts:42:93
   }
 };
 
-export const getQuotesFromUser = async (req: Request, res: Response, next: NextFunction) => {
-  try {
-    const quotes = await Quote.find({ user: req.params.user });
-    res.status(200).json(quotes);
-  } catch (err: any) {
-    res.locals.error = new QuotesRoutesError(err.message);
-    next(err);
-  }
-};
+export const getQuotesFromUser = async (req: Request, res: Response, next: NextFunction) => {};
 
 export const deleteQuote = async (req: Request, res: Response, next: NextFunction) => {

[NoCoverage] BlockStatement
quotes-api/src/controllers/quotes.ts:43:7
 };
 
 export const getQuotesFromUser = async (req: Request, res: Response, next: NextFunction) => {
-  try {
-    const quotes = await Quote.find({ user: req.params.user });
-    res.status(200).json(quotes);
-  } catch (err: any) {
+  try {} catch (err: any) {
     res.locals.error = new QuotesRoutesError(err.message);
     next(err);

[NoCoverage] BlockStatement
quotes-api/src/controllers/quotes.ts:46:22
   try {
     const quotes = await Quote.find({ user: req.params.user });
     res.status(200).json(quotes);
-  } catch (err: any) {
-    res.locals.error = new QuotesRoutesError(err.message);
-    next(err);
-  }
+  } catch (err: any) {}
 };
 

[NoCoverage] BlockStatement
quotes-api/src/controllers/quotes.ts:52:87
   }
 };
 
-export const deleteQuote = async (req: Request, res: Response, next: NextFunction) => {
-  try {
-    await Quote.deleteOne({ _id: req.params.id });
-    res.status(200).json({ message: 'Deleted quote successfully' });
-  } catch (err: any) {
-    res.locals.error = new QuotesRoutesError(err.message);
-    next(err);
-  }
-};
+export const deleteQuote = async (req: Request, res: Response, next: NextFunction) => {};
 

[NoCoverage] BlockStatement
quotes-api/src/controllers/quotes.ts:53:7
 };
 
 export const deleteQuote = async (req: Request, res: Response, next: NextFunction) => {
-  try {
-    await Quote.deleteOne({ _id: req.params.id });
-    res.status(200).json({ message: 'Deleted quote successfully' });
-  } catch (err: any) {
+  try {} catch (err: any) {
     res.locals.error = new QuotesRoutesError(err.message);
     next(err);

[NoCoverage] StringLiteral
quotes-api/src/controllers/quotes.ts:55:37
 export const deleteQuote = async (req: Request, res: Response, next: NextFunction) => {
   try {
     await Quote.deleteOne({ _id: req.params.id });
-    res.status(200).json({ message: 'Deleted quote successfully' });
+    res.status(200).json({ message: "" });
   } catch (err: any) {
     res.locals.error = new QuotesRoutesError(err.message);

[NoCoverage] BlockStatement
quotes-api/src/controllers/quotes.ts:56:22
   try {
     await Quote.deleteOne({ _id: req.params.id });
     res.status(200).json({ message: 'Deleted quote successfully' });
-  } catch (err: any) {
-    res.locals.error = new QuotesRoutesError(err.message);
-    next(err);
-  }
+  } catch (err: any) {}
 };
 
