[NoCoverage] BlockStatement
quotes-api/src/controllers/users.ts:10:86
 
 dotenv.config();
 
-export const signupUser = async (req: Request, res: Response, next: NextFunction) => {
-  try {
-    const { username, password } = req.body;
-    if (!username || !password) {
-      return res.status(400).json({ error: 'Input password and email please' });
-    }
-    const existingUser = await User.findOne({ username });
-    if (existingUser) {
-      return res.status(400).json({ error: 'username already exists' });
-    }
-    const newUser = new User({ username, password });
-    await newUser.save();
-    res.status(200).json({ message: 'account created successfully' });
-  } catch (err) {
-    next(err);
-  }
-};
+export const signupUser = async (req: Request, res: Response, next: NextFunction) => {};
 
 export const loginUser = async (req: Request, res: Response, next: NextFunction) => {

[NoCoverage] BlockStatement
quotes-api/src/controllers/users.ts:11:7
 dotenv.config();
 
 export const signupUser = async (req: Request, res: Response, next: NextFunction) => {
-  try {
-    const { username, password } = req.body;
-    if (!username || !password) {
-      return res.status(400).json({ error: 'Input password and email please' });
-    }
-    const existingUser = await User.findOne({ username });
-    if (existingUser) {
-      return res.status(400).json({ error: 'username already exists' });
-    }
-    const newUser = new User({ username, password });
-    await newUser.save();
-    res.status(200).json({ message: 'account created successfully' });
-  } catch (err) {
+  try {} catch (err) {
     next(err);
   }

[NoCoverage] ConditionalExpression
quotes-api/src/controllers/users.ts:13:9
 export const signupUser = async (req: Request, res: Response, next: NextFunction) => {
   try {
     const { username, password } = req.body;
-    if (!username || !password) {
+    if (false) {
       return res.status(400).json({ error: 'Input password and email please' });
     }

[NoCoverage] BlockStatement
quotes-api/src/controllers/users.ts:13:33
 export const signupUser = async (req: Request, res: Response, next: NextFunction) => {
   try {
     const { username, password } = req.body;
-    if (!username || !password) {
-      return res.status(400).json({ error: 'Input password and email please' });
-    }
+    if (!username || !password) {}
     const existingUser = await User.findOne({ username });
     if (existingUser) {

[NoCoverage] ConditionalExpression
quotes-api/src/controllers/users.ts:17:9
       return res.status(400).json({ error: 'Input password and email please' });
     }
     const existingUser = await User.findOne({ username });
-    if (existingUser) {
+    if (false) {
       return res.status(400).json({ error: 'username already exists' });
     }

[NoCoverage] ConditionalExpression
quotes-api/src/controllers/users.ts:17:9
       return res.status(400).json({ error: 'Input password and email please' });
     }
     const existingUser = await User.findOne({ username });
-    if (existingUser) {
+    if (true) {
       return res.status(400).json({ error: 'username already exists' });
     }

[NoCoverage] StringLiteral
quotes-api/src/controllers/users.ts:18:44
     }
     const existingUser = await User.findOne({ username });
     if (existingUser) {
-      return res.status(400).json({ error: 'username already exists' });
+      return res.status(400).json({ error: "" });
     }
     const newUser = new User({ username, password });

[NoCoverage] BlockStatement
quotes-api/src/controllers/users.ts:23:17
     const newUser = new User({ username, password });
     await newUser.save();
     res.status(200).json({ message: 'account created successfully' });
-  } catch (err) {
-    next(err);
-  }
+  } catch (err) {}
 };
 

[Survived] BooleanLiteral
quotes-api/src/controllers/users.ts:31:22
 export const loginUser = async (req: Request, res: Response, next: NextFunction) => {
   try {
     const { username, password } = req.body;
-    if (!username || !password) {
+    if (!username || password) {
       return res.status(400).json({ error: 'Input password and email please' });
     }

[Survived] LogicalOperator
quotes-api/src/controllers/users.ts:31:9
 export const loginUser = async (req: Request, res: Response, next: NextFunction) => {
   try {
     const { username, password } = req.body;
-    if (!username || !password) {
+    if (!username && !password) {
       return res.status(400).json({ error: 'Input password and email please' });
     }

[NoCoverage] ObjectLiteral
quotes-api/src/controllers/users.ts:32:35
   try {
     const { username, password } = req.body;
     if (!username || !password) {
-      return res.status(400).json({ error: 'Input password and email please' });
+      return res.status(400).json({});
     }
     const user:UserModel = await User.findOne({ username });

[NoCoverage] BlockStatement
quotes-api/src/controllers/users.ts:35:16
       return res.status(400).json({ error: 'Input password and email please' });
     }
     const user:UserModel = await User.findOne({ username });
-    if (!user) {
-      return res.status(400).json({ error: 'incorrect username and password' });
-    }
+    if (!user) {}
     const isPassword = await bcrypt.compare(password, user.password);
 

[Survived] ConditionalExpression
quotes-api/src/controllers/users.ts:35:9
       return res.status(400).json({ error: 'Input password and email please' });
     }
     const user:UserModel = await User.findOne({ username });
-    if (!user) {
+    if (true) {
       return res.status(400).json({ error: 'incorrect username and password' });
     }

[Survived] ConditionalExpression
quotes-api/src/controllers/users.ts:40:9
     }
     const isPassword = await bcrypt.compare(password, user.password);
 
-    if (!isPassword) return res.status(400).json({ error: 'incorrect email and password' });
+    if (true) return res.status(400).json({ error: 'incorrect email and password' });
 
     if (!process.env.JWT_SECRET) {

[Survived] BooleanLiteral
quotes-api/src/controllers/users.ts:40:9
     }
     const isPassword = await bcrypt.compare(password, user.password);
 
-    if (!isPassword) return res.status(400).json({ error: 'incorrect email and password' });
+    if (isPassword) return res.status(400).json({ error: 'incorrect email and password' });
 
     if (!process.env.JWT_SECRET) {

[NoCoverage] BlockStatement
quotes-api/src/controllers/users.ts:42:34
 
     if (!isPassword) return res.status(400).json({ error: 'incorrect email and password' });
 
-    if (!process.env.JWT_SECRET) {
-      process.exit(1);
-    }
+    if (!process.env.JWT_SECRET) {}
     const tokenSecret: string = process.env.JWT_SECRET!;
     // generate a token and save to database and session

[Survived] ConditionalExpression
quotes-api/src/controllers/users.ts:42:9
 
     if (!isPassword) return res.status(400).json({ error: 'incorrect email and password' });
 
-    if (!process.env.JWT_SECRET) {
+    if (false) {
       process.exit(1);
     }

[Killed] BlockStatement
quotes-api/src/controllers/users.ts:49:41
     // generate a token and save to database and session
     jwt.sign({
       username,
-    }, tokenSecret, {}, (err, token) => {
-      if (err) return next(err);
-      req.session.token = token!;
-      res.status(200).json({ message: 'login successfully' });
-    });
+    }, tokenSecret, {}, (err, token) => {});
   } catch (err) {
     next(err);
killedBy: Some test POST - login
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Use jest.setTimeout(newTimeout) to increase the timeout value, if this is a long-running test."

[Survived] ConditionalExpression
quotes-api/src/controllers/users.ts:50:11
     jwt.sign({
       username,
     }, tokenSecret, {}, (err, token) => {
-      if (err) return next(err);
+      if (false) return next(err);
       req.session.token = token!;
       res.status(200).json({ message: 'login successfully' });

[Survived] ConditionalExpression
quotes-api/src/controllers/users.ts:50:11
     jwt.sign({
       username,
     }, tokenSecret, {}, (err, token) => {
-      if (err) return next(err);
+      if (true) return next(err);
       req.session.token = token!;
       res.status(200).json({ message: 'login successfully' });

[Survived] StringLiteral
quotes-api/src/controllers/users.ts:52:39
     }, tokenSecret, {}, (err, token) => {
       if (err) return next(err);
       req.session.token = token!;
-      res.status(200).json({ message: 'login successfully' });
+      res.status(200).json({ message: "" });
     });
   } catch (err) {

[Survived] ObjectLiteral
quotes-api/src/controllers/users.ts:52:28
     }, tokenSecret, {}, (err, token) => {
       if (err) return next(err);
       req.session.token = token!;
-      res.status(200).json({ message: 'login successfully' });
+      res.status(200).json({});
     });
   } catch (err) {

[NoCoverage] BlockStatement
quotes-api/src/controllers/users.ts:54:17
       req.session.token = token!;
       res.status(200).json({ message: 'login successfully' });
     });
-  } catch (err) {
-    next(err);
-  }
+  } catch (err) {}
 };
 
