[NoCoverage] BlockStatement
quotes-api/src/helpers/errors.ts:2:29
 export class QuotesRoutesError extends Error {
-  constructor(message: any) {
-    super();
-    this.message = message;
-  }
+  constructor(message: any) {}
 }
 
