[NoCoverage] LogicalOperator
typescript/quotes-api/src/index.ts:8:14
 
 dontenv.config();
 
-const PORT = process.env.PORT || 3000;
+const PORT = process.env.PORT && 3000;
 
 App().then((app) => {

[NoCoverage] ConditionalExpression
typescript/quotes-api/src/index.ts:8:14
 
 dontenv.config();
 
-const PORT = process.env.PORT || 3000;
+const PORT = false;
 
 App().then((app) => {

[NoCoverage] BlockStatement
typescript/quotes-api/src/index.ts:10:21
 
 const PORT = process.env.PORT || 3000;
 
-App().then((app) => {
-  http.createServer(app).listen(PORT, (err: Error) => {
-    if (err) {
-      console.log(err.message);
-      process.exit(1);
-    }
-    console.log('Server running at port ', PORT);
-  });
-});
+App().then((app) => {});
 

[NoCoverage] BlockStatement
typescript/quotes-api/src/index.ts:11:55
 const PORT = process.env.PORT || 3000;
 
 App().then((app) => {
-  http.createServer(app).listen(PORT, (err: Error) => {
-    if (err) {
-      console.log(err.message);
-      process.exit(1);
-    }
-    console.log('Server running at port ', PORT);
-  });
+  http.createServer(app).listen(PORT, (err: Error) => {});
 });
 

[NoCoverage] ConditionalExpression
typescript/quotes-api/src/index.ts:12:9
 
 App().then((app) => {
   http.createServer(app).listen(PORT, (err: Error) => {
-    if (err) {
+    if (false) {
       console.log(err.message);
       process.exit(1);

[NoCoverage] BlockStatement
typescript/quotes-api/src/index.ts:12:14
 
 App().then((app) => {
   http.createServer(app).listen(PORT, (err: Error) => {
-    if (err) {
-      console.log(err.message);
-      process.exit(1);
-    }
+    if (err) {}
     console.log('Server running at port ', PORT);
   });

[NoCoverage] StringLiteral
typescript/quotes-api/src/index.ts:16:17
       console.log(err.message);
       process.exit(1);
     }
-    console.log('Server running at port ', PORT);
+    console.log("", PORT);
   });
 });
