[Survived] ConditionalExpression
quotes-api/src/model/user.ts:9:5
 dotenv.config();
 
 const SF = process.env.SALT_FACTOR;
-if (!SF) {
+if (false) {
   console.log('salt factor do not exist');
   process.exit(1);

[NoCoverage] BlockStatement
quotes-api/src/model/user.ts:9:10
 dotenv.config();
 
 const SF = process.env.SALT_FACTOR;
-if (!SF) {
-  console.log('salt factor do not exist');
-  process.exit(1);
-}
+if (!SF) {}
 const SALT_FACTOR: number = Number(SF);
 

[Survived] ObjectLiteral
quotes-api/src/model/user.ts:15:40
 }
 const SALT_FACTOR: number = Number(SF);
 
-const UserSchema = new mongoose.Schema({
-  username: { type: String, required: true, unique: true },
-  password: { type: String, required: true },
-  // TODO - store QuoteModel in Arrays here - how to link documents in mongoDB
-  quotes: [String],
-});
+const UserSchema = new mongoose.Schema({});
 
 // eslint-disable-next-line func-names

[Survived] BooleanLiteral
quotes-api/src/model/user.ts:16:53
 const SALT_FACTOR: number = Number(SF);
 
 const UserSchema = new mongoose.Schema({
-  username: { type: String, required: true, unique: true },
+  username: { type: String, required: true, unique: false },
   password: { type: String, required: true },
   // TODO - store QuoteModel in Arrays here - how to link documents in mongoDB

[Survived] BooleanLiteral
quotes-api/src/model/user.ts:16:39
 const SALT_FACTOR: number = Number(SF);
 
 const UserSchema = new mongoose.Schema({
-  username: { type: String, required: true, unique: true },
+  username: { type: String, required: false, unique: true },
   password: { type: String, required: true },
   // TODO - store QuoteModel in Arrays here - how to link documents in mongoDB

[Survived] BooleanLiteral
quotes-api/src/model/user.ts:17:39
 
 const UserSchema = new mongoose.Schema({
   username: { type: String, required: true, unique: true },
-  password: { type: String, required: true },
+  password: { type: String, required: false },
   // TODO - store QuoteModel in Arrays here - how to link documents in mongoDB
   quotes: [String],

[Survived] ArrayDeclaration
quotes-api/src/model/user.ts:19:11
   username: { type: String, required: true, unique: true },
   password: { type: String, required: true },
   // TODO - store QuoteModel in Arrays here - how to link documents in mongoDB
-  quotes: [String],
+  quotes: [],
 });
 

[NoCoverage] BlockStatement
quotes-api/src/model/user.ts:23:40
 });
 
 // eslint-disable-next-line func-names
-UserSchema.pre('save', function (done) {
-  const user:any = this;
-  if (!user.isModified('password')) return done();
-
-  bcrypt.genSalt(SALT_FACTOR, (err, salt) => {
-    if (err) {
-      return done(err);
-    }
-    bcrypt.hash(user.password, salt, (err1, hashedPassword) => {
-      if (err1) {
-        return done(err1);
-      }
-      user.password = hashedPassword;
-      done();
-    });
-  });
-});
+UserSchema.pre('save', function (done) {});
 
 export const User = mongoose.model('User', UserSchema);

[Survived] StringLiteral
quotes-api/src/model/user.ts:23:16
 });
 
 // eslint-disable-next-line func-names
-UserSchema.pre('save', function (done) {
+UserSchema.pre("", function (done) {
   const user:any = this;
   if (!user.isModified('password')) return done();

[NoCoverage] ConditionalExpression
quotes-api/src/model/user.ts:25:7
 // eslint-disable-next-line func-names
 UserSchema.pre('save', function (done) {
   const user:any = this;
-  if (!user.isModified('password')) return done();
+  if (true) return done();
 
   bcrypt.genSalt(SALT_FACTOR, (err, salt) => {

[NoCoverage] BooleanLiteral
quotes-api/src/model/user.ts:25:7
 // eslint-disable-next-line func-names
 UserSchema.pre('save', function (done) {
   const user:any = this;
-  if (!user.isModified('password')) return done();
+  if (user.isModified('password')) return done();
 
   bcrypt.genSalt(SALT_FACTOR, (err, salt) => {

[NoCoverage] BlockStatement
quotes-api/src/model/user.ts:27:46
   const user:any = this;
   if (!user.isModified('password')) return done();
 
-  bcrypt.genSalt(SALT_FACTOR, (err, salt) => {
-    if (err) {
-      return done(err);
-    }
-    bcrypt.hash(user.password, salt, (err1, hashedPassword) => {
-      if (err1) {
-        return done(err1);
-      }
-      user.password = hashedPassword;
-      done();
-    });
-  });
+  bcrypt.genSalt(SALT_FACTOR, (err, salt) => {});
 });
 

[NoCoverage] BlockStatement
quotes-api/src/model/user.ts:28:14
   if (!user.isModified('password')) return done();
 
   bcrypt.genSalt(SALT_FACTOR, (err, salt) => {
-    if (err) {
-      return done(err);
-    }
+    if (err) {}
     bcrypt.hash(user.password, salt, (err1, hashedPassword) => {
       if (err1) {

[NoCoverage] ConditionalExpression
quotes-api/src/model/user.ts:28:9
   if (!user.isModified('password')) return done();
 
   bcrypt.genSalt(SALT_FACTOR, (err, salt) => {
-    if (err) {
+    if (false) {
       return done(err);
     }

[NoCoverage] BlockStatement
quotes-api/src/model/user.ts:31:64
     if (err) {
       return done(err);
     }
-    bcrypt.hash(user.password, salt, (err1, hashedPassword) => {
-      if (err1) {
-        return done(err1);
-      }
-      user.password = hashedPassword;
-      done();
-    });
+    bcrypt.hash(user.password, salt, (err1, hashedPassword) => {});
   });
 });

[NoCoverage] ConditionalExpression
quotes-api/src/model/user.ts:32:11
       return done(err);
     }
     bcrypt.hash(user.password, salt, (err1, hashedPassword) => {
-      if (err1) {
+      if (true) {
         return done(err1);
       }

[NoCoverage] ConditionalExpression
quotes-api/src/model/user.ts:32:11
       return done(err);
     }
     bcrypt.hash(user.password, salt, (err1, hashedPassword) => {
-      if (err1) {
+      if (false) {
         return done(err1);
       }
