[Survived] StringLiteral
quotes-api/src/routes/quotes.ts:11:12
 
 Router.get('/quotes', getAllQuote);
 
-Router.get('/quote/:id', getSingleQuote);
+Router.get("", getSingleQuote);
 
 Router.post('/quote', postQuote);

[Survived] StringLiteral
quotes-api/src/routes/quotes.ts:17:15
 
 Router.get('/quotes/:user', getQuotesFromUser);
 
-Router.delete('/quote/:id', deleteQuote);
+Router.delete("", deleteQuote);
 
 export const quotesRouter = Router;
